soap-examples/temperature-conversion.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns2:convertTemperature xmlns:ns2="http://ws.grupo3.edu.ec/">
      <value>25.0</value>
      <fromUnit>CELSIUS</fromUnit>
      <toUnit>FAHRENHEIT</toUnit>
    </ns2:convertTemperature>
  </soap:Body>
</soap:Envelope>
